AA-CubeSat-Team/soci_cdh_drivers/powermode_based_prototype/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_AD_B0_07 (number 101), UART1_RXD/J17[4] */
/* Routed pin properties */
#define BOARD_UART1_RXD_PERIPHERAL                                       LPUART1   /*!< Peripheral name */
#define BOARD_UART1_RXD_SIGNAL                                                RX   /*!< Signal name */

/* GPIO_AD_B0_06 (number 105), UART1_TXD/J17[6] */
/* Routed pin properties */
#define BOARD_UART1_TXD_PERIPHERAL                                       LPUART1   /*!< Peripheral name */
#define BOARD_UART1_TXD_SIGNAL                                                TX   /*!< Signal name */

/* GPIO_AD_B0_11 (number 97), ENET_CRS_DV/U11[18]/J19[3] */
/* Routed pin properties */
#define BOARD_ENET_CRS_DV_PERIPHERAL                                         ARM   /*!< Peripheral name */
#define BOARD_ENET_CRS_DV_SIGNAL                                   arm_trace_swo   /*!< Signal name */

/* GPIO_AD_B0_15 (number 93), ENET_TXD1/U11[25]/J19[2] */
/* Routed pin properties */
#define BOARD_ENET_TXD1_PERIPHERAL                                       LPUART3   /*!< Peripheral name */
#define BOARD_ENET_TXD1_SIGNAL                                                RX   /*!< Signal name */

/* GPIO_AD_B0_14 (number 94), ENET_TXD0/U11[24]/J17[7] */
/* Routed pin properties */
#define BOARD_ENET_TXD0_PERIPHERAL                                       LPUART3   /*!< Peripheral name */
#define BOARD_ENET_TXD0_SIGNAL                                                TX   /*!< Signal name */

/* GPIO_SD_B0_00 (number 48), SD1_D2/J15[1] */
/* Routed pin properties */
#define BOARD_SD1_D2_PERIPHERAL                                           LPI2C3   /*!< Peripheral name */
#define BOARD_SD1_D2_SIGNAL                                                  SCL   /*!< Signal name */

/* GPIO_SD_B0_01 (number 47), SD1_D3/J15[2] */
/* Routed pin properties */
#define BOARD_SD1_D3_PERIPHERAL                                           LPI2C3   /*!< Peripheral name */
#define BOARD_SD1_D3_SIGNAL                                                  SDA   /*!< Signal name */

/* WAKEUP (number 52), USER_BUTTON */
/* Routed pin properties */
#define BOARD_USER_BUTTON_PERIPHERAL                                       GPIO5   /*!< Peripheral name */
#define BOARD_USER_BUTTON_SIGNAL                                         gpio_io   /*!< Signal name */
#define BOARD_USER_BUTTON_CHANNEL                                             0U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_USER_BUTTON_GPIO                                             GPIO5   /*!< GPIO peripheral base pointer */
#define BOARD_USER_BUTTON_GPIO_PIN                                            0U   /*!< GPIO pin number */
#define BOARD_USER_BUTTON_GPIO_PIN_MASK                               (1U << 0U)   /*!< GPIO pin mask */

/* GPIO_AD_B0_04 (number 107), JTAG_TDO/J16[13]/ENET_RST/U11[32] */
/* Routed pin properties */
#define BOARD_ENET_RST_PERIPHERAL                                           JTAG   /*!< Peripheral name */
#define BOARD_ENET_RST_SIGNAL                                                TDO   /*!< Signal name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
